//=============================================================================
//
// read.h
// Author : koduna hirohito
//
//=============================================================================
#ifndef _READ_H_			//このマクロ定義がされなかったら
#define _READ_H_			//2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"
#include "3dobject.h"
#include "manager.h"
#include <list>

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CMeshfield;
class C3DObject;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CRead
{
	static const int LINE_MAX_READING_LENGTH = 256;
public:

	CRead();
	~CRead();
	CMeshfield *ReadMap(char *sFilePath);
	int ReadXFile(char *sXFilePath);
	void ReadEditorText(char *sFilePath);
	void SaveEditorData(std::list<C3DObject*> data);

private:
	
};

#endif