//=============================================================================
//
// 弾.cpp (Bullet.cpp)
// Author : Saito Shian
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "application.h"
#include "renderer.h"
#include "bullet.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================

//=============================================================================
// コンストラクタ
//=============================================================================
CBullet::CBullet(const PRIORITY priority) : CObject3D(priority)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CBullet::~CBullet()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CBullet::Init()
{
	// オブジェクト3Dの初期化処理
	CObject3D::Init();

	//==================================================
	// メンバ変数の初期化
	//==================================================
	m_nLife = 0;			// 寿命の初期化

	// 弾のテクスチャ
	SetTexture(CTexture::TEXTURE_BULLET);

	// ビルボードの設定
	Setbillboard(true);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CBullet::Uninit()
{
	// オブジェクト3Dの終了処理
	CObject3D::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CBullet::Update()
{
	// 取得
	D3DXVECTOR3 pos = GetPos();
	D3DXVECTOR3 move = GetMove();

	//弾の位置更新
	pos += move;

	//前回の位置を保存
	m_nPosOld = pos;

	// 寿命を減らす
	m_nLife--;
	if (m_nLife <= 0)
	{
		Uninit();
		return;
	}

	// 位置の設定
	SetPos(pos);

	// オブジェクト3Dの更新処理
	CObject3D::Update();
}

//=============================================================================
// 描画処理
//=============================================================================
void CBullet::Draw()
{
	// オブジェクト3Dの描画処理
	CObject3D::Draw();
}

//=============================================================================
// 生成処理
//=============================================================================
CBullet* CBullet::Create(const D3DXVECTOR3 & pos, float xsize, float ysize, D3DXVECTOR3 move, int life, const PRIORITY priority)
{
	//クラスの生成
	CBullet* pBullet = new CBullet(priority);

	//nullチェック
	if (pBullet != nullptr)
	{
		//初期化処理
		pBullet->Init();
		//設定処理
		pBullet->SetPos(pos);
		pBullet->SetMove(move);
		pBullet->SetLife(life);
		pBullet->SetSize(D3DXVECTOR2(xsize, ysize));
	}
	else
	{
		assert(false);
	}

	return pBullet;
}

