//=============================================================================
//
// enemy.cpp
// Author : Tanimoto Kosuke
//
//=============================================================================
#include "enemy.h"
#include "enemy_manager.h"
#include "application.h"

//=====================================
// デフォルトコンストラクタ
//=====================================
CEnemy::CEnemy()
{
	// 生成時に自身のポインタを敵キャラマネージャーに設定
	CApplication::GetEnemyManager()->SetEnemy(this);
}

//=====================================
// デストラクタ
//=====================================
CEnemy::~CEnemy()
{
	CEnemyManager* pManager = CApplication::GetEnemyManager();

	// マネージャーが使用中の場合、解放時に自身のポインタを配列から除外する
	if (pManager != nullptr) pManager->DestroyEnemy(this);
}

//============================================================================
// 初期化処理
//============================================================================
HRESULT CEnemy::Init()
{
	// タグの設定
	SetTag(TAG_ENEMY);

	// 当たり判定の生成
	SetCollision();

	CCharacter::Init();

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CEnemy::Uninit()
{
	CCharacter::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CEnemy::Update()
{
	// キャラクターの更新
	CCharacter::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CEnemy::Draw()
{
	CCharacter::Draw();
}

//============================================================================
// 被弾処理
//============================================================================
void CEnemy::Hit(CMove_Object* pHit)
{
	// ヒットした移動オブジェクトが使用中の場合
	if (pHit != nullptr)
	{
		// ヒットした移動オブジェクトのタグを取得
		TAG tag = pHit->GetTag();

		// タグから種類を選ぶ
		switch (tag)
		{
		case TAG_PLAYER :
			break;
		case TAG_ENEMY :
			break;
		case TAG_BULLET:
			// 弾のダメージを返す
			Damage(pHit->GetPower());
			break;
		default:
			break;
		}
	}
}

//============================================================================
// 破壊処理
//============================================================================
void CEnemy::Destroy()
{
	CCharacter::Destroy();
}