//============================================================================
//
// モーション	motion.cpp
// Author : Tanimoto Kosuke
//
//============================================================================
#include "motion.h"

//=====================================
// デフォルトコンストラクタ
//=====================================
CMotion::CMotion()
{

}

//=====================================
// デストラクタ
//=====================================
CMotion::~CMotion()
{

}

//=====================================
// 全てのモーションの破棄処理
//=====================================
void CMotion::ReleaseAll()
{
	// モーションを全て終了させる
	m_MotionPatternData.clear();
	m_UseFileName.clear();
}

//==============================================================================================
// モーション値の読み込み
//==============================================================================================
void CMotion::SetMotionData(MotionPattern motion, std::string name)
{
	// 名前が使用されていない場合
	if (std::count(m_UseFileName.begin(), m_UseFileName.end(), name) == false)
	{
		// モーション情報を設定
		m_MotionPatternData[name].push_back(motion);
	}
}
